# γραμμή 7-8: ο χρήστης εισάγει δύο ακέραιους αριθμούς και ορίζει τις μεταβλητές x και y 
# γραμμή 10: δημιουργούμε μια μεταβλητή i που ξεκινάει από το 1 (και αυξάνεται κατά 1, όταν χρειάζεται, βλ. παρακάτω) για να πολ/ζουμε το x ή y με τη μεταβλητή αυτή και να κάνουμε δοκιμές
# γραμμή 12-15: αν το x > y, όσο το υπόλοιπο της διαίρεσης (x * i) / y είναι <> 0 το i θα αυξάνεται κατά 1. Όταν το αποτέλεσμα της διαίρεσης γίνει 0, θα εμφανιστεί το αποτέλεσμα και το πρόγραμμα θα τελειώσει
# γραμμή 17-20: αν y > x, ομοίως με παραπάνω
# γραμμή 22-23: αν x = y, τότε το ΕΚΠ είναι αυτός ο ίδιος αριθμός

x =  int(input("Eισάγετε τον πρώτο αριθμό: "))
y =  int(input("Eισάγετε τον δεύτερο αριθμό: "))

i = 1

if x > y:
    while (x * i) % y != 0:
        i = i + 1
    print("Το ΕΚΠ είναι το: " + str(x * i))

if y > x:
    while (y * i) % x != 0:
        i = i + 1
    print("Το ΕΚΠ είναι το: " + str(y * i))

if x == y:
    print("To ΕΚΠ είναι το: " + str(x))
