# γραμμή 7: ο χρήστης εισάγει έναν αριθμό (ακέραιο), ο οποίος ορίζει τη μεταβλητή x
# γραμμή 8: ελέγχεται αν ο αριθμός διαιρείται ακριβώς με το 2 (αν, δηλαδή, το υπόλοιπο της διαίρεσης είναι 0)
# γραμμή 9: αν το υπόλοιπο είναι 0, εμφάνιση μηνύματος ότι ο αριθμός είναι ζυγός
# γραμμή 10: σε περίπτωση που το υπόλοιπο δεν είναι 0
# γραμμή 11: αν το υπόλοιπο δεν είναι 0, εμφάνιση μηνύματος ότι ο αριθμός είναι μονός

x = int(input("Εισάγετε έναν αριθμό:"))
if x % 2 == 0:
    print("Ο αριθμός είναι ζυγός.")
else:
    print("ο αριθμός είναι μονός.")
