# Υπολογισμός της προπαίδειας οποιουδήποτε ακέραιου αριθμού
# Αρχικά ορίζουμε μια μεταβλητή που αποθηκεύει έναν ακέραιο αριθμό που εισάγει ο χρήστης.
# Ορίζουμε μια μεταβλητή i που θα χρησιμοποιήσουμε αργότερα για να πολλαπλασιάσουμε.
# Ορίζουμε ότι ο αλγόριθμος του πολλαπλασιασμού πρέπει να τρέξει όσο το i είναι ανάμεσα από 0 και 10.
# Γίνεται ο πολλαπλασιασμός και εμφανιζεται το αποτέλεσμα.
# Το i μεγαλώνει κατά 1, έχοντας ξεκινήσει από το 0.
# Η διαδικασία μετά το while επαναλαμβάνεται έως ότου το i γίνει 10.

x = int(input("Υπολόγισε την προπαίδεια του αριθμού: "))
i=0
while i<=10:
    print (x * i)
    i += 1
