# γραμμή 8: ο χρήστης εισάγει την ηλικία του (ακέραιος αριθμός) και ορίζει την μεταβλητή x
# γραμμή 9: αν η τιμή του x είναι μεγαλύτερη ή ίση του 18
# γραμμή 10: εμφανίζεται το κείμενο "είστε ενήλικος"
# γραμμή 11: αν η τιμή του x είναι μικρότερη του 18
# γραμμή 12: υπολογίζεται πόσα χρόνια απομένουν μέχρι τα 18 και ορίζεται η μεταβλητή y
# γραμμή 13: εμφανίζεται κείμενο και η μεταβλητή y (ως κείμενο)

x = int(input ("Εισάγετε ηλικία:"))
if x >= 18:
    print ("Είστε ενήλικος.")
else:
    y = int(18 - x)
    print ("Χρειάζεστε ακόμη " + str(y) + " χρόνια για να ενηληκιωθείτε.")
