# γραμμή 6-9: ο χρήστης εισάγει 3 αριθμούς και ορίζει τις μεταβλητές x, y και z αντίστοιχα
# γραμμή 10-14: αν η τιμή του x είναι μεγαλύτερη από το y και το z, τότε το x μπαίνει πρώτο και ελέγχεται αν το y είναι μεγαλύτερο ή μικρότερο του z, για να γίνει σωστά η κατάταξη
# γραμμή 16-20: αν η τιμή του y είναι μεγαλύτερη από το x και το z, τότε το y μπαίνει πρώτο και ελέγχεται αν το x είναι μεγαλύτερο ή μικρότερο του z, για να γίνει σωστά η κατάταξη
# γραμμή 22-26: αν η τιμή του x είναι μεγαλύτερη ή μικρότερη από το y, τότε το z μπαίνει πρώτο και το x μπαίνει πριν ή μετά το y αντίστοιχα

x =  int(input("Εισάγετε τον πρώτο αριθμό: "))
y =  int(input("Εισάγετε τον δεύτερο αριθμό: "))
z =  int(input("Εισάγετε τον τρίτο αριθμό: "))

if x > y and x > z:
    if y > z:
        print (str (x) + ">" + str(y) + ">" + str(z))
    if y < z:
        print (str (x) + ">" + str(z) + ">" + str(y))

elif y > x and y > z:
    if x > z:
        print (str (y) + ">" + str(x) + ">" + str(z))
    if x < z:
        print (str (y) + ">" + str(z) + ">" + str(x))

else:
    if x > y:
        print (str (z) + ">" + str(x) + ">" + str(y))
    if x < y:
        print (str (z) + ">" + str(y) + ">" + str(x))
