# Υπολογισμός της προπαίδειας οποιουδήποτε ακέραιου αριθμού

# Αρχικά ορίζουμε μια μεταβλητή που αποθηκεύει έναν ακέραιο αριθμό που εισάγει ο χρήστης.
x = int(input("Υπολόγισε την προπαίδεια του αριθμού: "))
# Ορίζουμε μια μεταβλητή i που θα χρησιμοποιήσουμε αργότερα για να πολλαπλασιάσουμε.
i=0
# Ορίζουμε ότι ο αλγόριθμος του πολλαπλασιασμού πρέπει να τρέξει όσο το i είναι ανάμεσα από 0 και 10.
while i<=10:
    # Γίνεται ο πολλαπλασιασμός και εμφανιζεται το αποτέλεσμα.
    print (x * i)
    # Το i μεγαλώνει κατά 1, έχοντας ξεκινήσει από το 0.
    i += 1
    # Η διαδικασία μετά το while επαναλαμβάνεται έως ότου το i γίνει 10.
