import time
onoma = input("Γράψε το όνομά σου: ")
time.sleep(1)
score = 0
print("Γεια σου" ,onoma,"\nΜαζί θα παίξουμε.. με τη γλώσσα \nΣε κάθε ερώτηση απάντησε γράφοντας A, B, C ή D" )
time.sleep(3)
a = input("1) Η πρόταση 'Μη μασας τα λόγια σου' ειναι: \n A.Μεταφορική  B.Κυριολεκτικη  C.Χρονική  D.Δευτερεύουσα   ")
if a == "A": 
    print("Μπράβο! Απάντησες σωστά")
    score = score + 1
else: 
    print("Η σωστή απάντηση είναι: Α.Μεταφορική")
time.sleep(2)

b = input("2) Ποιά από τις παρακάτω φράσεις είναι κυριολεκτική: \n A.Μέθυσε από το πολύ κρασί.  B.Μέθυσε από ευτυχία.  C.Αυτό σηκώνει πολλή συζήτηση.  D.Κόψαμε δρόμο περνώντας από το στενό    ")
if b == "A": 
    print("Μπράβο! Απάντησες σωστά!")
    score = score + 1
else: 
    print("Η σωστή απάντηση είναι: Α.Μέθυσε από το πολύ κρασί.")
time.sleep(2)

c = input("3) Η αντωνυμία άλλος, άλλη, άλλο είναι: \n A.Προσωπική  B.Δεικτική  C.Αόριστη  D.Κτητική   ")
if c == "C": 
    print("Μπράβο! Απάντησες σωστά")
    score = score + 1
else: 
    print("Η σωστή απάντηση είναι: C.Αόριστη")
time.sleep(2)

d = input("4) Στην πρόταση 'Εγώ ήθελα να δώσω την αγάπη μου σε ένα αδέσποτο' αόριστη αντωνυμία ειναι: \n A.το 'εγώ'  B.το 'ένα'  C.το 'μου'  D.το 'την'   ")
if d == "B": 
    print("Μπράβο! Απάντησες σωστά")
    score = score + 1
else: 
    print("Η σωστή απάντηση είναι: B.το 'ένα'")
time.sleep(2)

e = input("5) Το 'αηδόνι' συλλαβίζεται ως εξής: \n A.α-η-δό-νι  B.α-ηδ-ό-νι  C.α-ηδ-όνι  D.αη-δό-νι   ")
if e == "D": 
    print("Μπράβο! Απάντησες σωστά")
    score = score + 1
else: 
    print("Η σωστή απάντηση είναι: D.αη-δό-νι")
time.sleep(2)

print("Το σκορ σου είναι",score,"/5")
f = open("score.txt", "a")
save = str(onoma) + " " + str(score) + "/5"
f.write(save + "\n")